---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ExtendBelowBaseGreaterThanLandingBaseElevation
source: html/a1ee9f17-4f67-7d76-ad14-f6e68f97917e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ExtendBelowBaseGreaterThanLandingBaseElevation Property

Extend Below Base needs to be less than Landing Base Elevation.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExtendBelowBaseGreaterThanLandingBaseElevation { get; }
```